app/views/games/show.html.erb

SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = ?  [["game_id", 2]]
---

<% if @game.frames.length == 10 %>