app/views/frames/new.html.erb


    <% if @game.frames.length == 9 %>
---
SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = ?  [["game_id", 10]]