app/controllers/frames_controller.rb

def new
  @game = Game.find(params[:game_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

def create
  @game = Game.find(params[:game_id])
  @frame = @game.frames.create(frame_params)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "frames" ("ball_one", "frame_number", "frame_score", "strike", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["ball_one", 10], ["frame_number", 1], ["frame_score", 10], ["strike", true], ["game_id", 1], ["created_at", "2019-08-02 17:36:55.532403"], ["updated_at", "2019-08-02 17:36:55.532403"]]

def show
  @game = Game.find(params[:game_id])
  @frame = Frame.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "frames".* FROM "frames" WHERE "frames"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

def edit
  @game = Game.find(params[:game_id])
  @frame = Frame.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "frames".* FROM "frames" WHERE "frames"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]