app/controllers/games_controller.rb

  def create
    @game = Game.new(name: game_params["name"])

    if @game.save
---
INSERT INTO "games" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "dfdf"], ["created_at", "2019-08-02 17:36:51.522053"], ["updated_at", "2019-08-02 17:36:51.522053"]]