app/models/frame.rb

SELECT  "games".* FROM "games" ORDER BY "games"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = ?  [["game_id", 1]]
UPDATE "frames" SET "frame_score" = ?, "updated_at" = ? WHERE "frames"."id" = ?  [["frame_score", 20], ["updated_at", "2019-07-31 18:02:57.963177"], ["id", 91]]
UPDATE "frames" SET "frame_score" = ?, "updated_at" = ? WHERE "frames"."id" = ?  [["frame_score", 40], ["updated_at", "2019-07-31 22:52:43.754912"], ["id", 173]]
UPDATE "frames" SET "frame_score" = ?, "updated_at" = ? WHERE "frames"."id" = ?  [["frame_score", 10], ["updated_at", "2019-07-31 17:27:59.005650"], ["id", 69]]
UPDATE "frames" SET "frame_score" = ?, "updated_at" = ? WHERE "frames"."id" = ?  [["frame_score", 40], ["updated_at", "2019-07-31 21:26:15.761373"], ["id", 139]]
UPDATE "frames" SET "frame_score" = ?, "updated_at" = ? WHERE "frames"."id" = ?  [["frame_score", 40], ["updated_at", "2019-08-01 20:26:19.619814"], ["id", 2]]
---

  before_create do
    @game = self.game
    if @game.frames.length >= 1
      @one_frame_ago = @game.frames[-1]
      if @one_frame_ago.spare == true
        @one_frame_ago.update({frame_score: @one_frame_ago.frame_score + self.ball_one})
      end
      if @game.frames.length >= 2
        @two_frames_ago = @game.frames[-2]
        if @two_frames_ago.strike == true
          if @one_frame_ago.strike == true
            @two_frames_ago.update({frame_score: @two_frames_ago.frame_score + 10})
            if @one_frame_ago.frame_number == 9
              @one_frame_ago.update({frame_score: @one_frame_ago.frame_score + 30})
            else
              @one_frame_ago.update({frame_score: @one_frame_ago.frame_score + 20})
            end
          else
            @two_frames_ago.update({frame_score: @two_frames_ago.frame_score + @one_frame_ago.ball_one})

SELECT  "frames".* FROM "frames" ORDER BY "frames"."id" DESC LIMIT ?  [["LIMIT", 1]]
---

    self.strike = true if ball_one == 10
    self.spare = true if ball_one != 10 && get_frame_pin_total == 10
    self.frame_number = @game.frames.length + 1