app/models/frame.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = ?  [["game_id", 1]]
---
  def set_frame_number
    frame_number = self.game.frames.length